{
  "retcode": 0,
  "message": "OK",
  "data": {
    "content": {
      "id": 0,
      "dialogues": [
        {
          "text": "Seele, thank you so much! We've finalized the recipes for the drinks quickly!",
          "audio": "",
          "role": 2
        },
        {
          "text": "Drop the compliments. I just couldn't stand it anymore.",
          "audio": "",
          "role": 1
        },
        {
          "text": "It's a fragrant and sweet drink. Everyone will definitely love it... Huh, wait a minute!",
          "audio": "",
          "role": 2
        },
        { "text": "What's wrong now?", "audio": "", "role": 1 },
        {
          "text": "I almost forgot. You don't have a sweet tooth.",
          "audio": "",
          "role": 2
        },
        { "text": "Humph. You finally remembered!", "audio": "", "role": 1 },
        {
          "text": "Then... do you like ginger tea? I heard it tastes hot and spicy.",
          "audio": "",
          "role": 2
        },
        {
          "text": "What kind of strange drink is that? No one would enjoy something like that!",
          "audio": "",
          "role": 1
        },
        {
          "text": "Let me think... how about sprinkling chili powder in hot cocoa? Would that be okay?",
          "audio": "",
          "role": 2
        },
        { "text": "... Forget it.", "audio": "", "role": 1 },
        {
          "text": "You were busy in the kitchen all by yourself yesterday, and it seems like you're still confused today. Let me take care of it.",
          "audio": "",
          "role": 1
        },
        { "text": "Huh, Seele, can you cook too?", "audio": "", "role": 2 },
        {
          "text": "O-Of course, there are many things I can do!",
          "audio": "",
          "role": 1
        },
        {
          "text": "What do you plan to make? I'm really looking forward to it!",
          "audio": "",
          "role": 2
        },
        {
          "text": "Haha, of course they're all Seele's favorite drinks!",
          "audio": "",
          "role": 1
        },
        {
          "text": "That's great, Seele! After you finish, let me taste them too. I'm really excited to add your drinks to the menu!",
          "audio": "",
          "role": 2
        },
        {
          "text": "Why would you want to taste something I made out of the blue?",
          "audio": "",
          "role": 1
        },
        {
          "text": "Because you gave me very helpful suggestions yesterday!",
          "audio": "",
          "role": 2
        },
        {
          "text": "... Well, since that's the case, I'll make it slightly more to your taste.",
          "audio": "",
          "role": 1
        },
        {
          "text": "Great! While you're cooking, I'll decorate the room~",
          "audio": "",
          "role": 2
        },
        {
          "text": "... You really can't stay idle. Fine, it's up to you.",
          "audio": "",
          "role": 1
        }
      ]
    }
  }
}
